# [기본 출력 명령어]
# 소괄호 안에 있는걸 출력.
# 문자의 경우 따옴표나 쌍따옴표를 사용.

print(1111)     # 출력값 : 1111

print('차은우')    # 출력값 : 차은우

print("차은우" * 100)  # 출력값 : 차은우차은우차은우차은우차은우차은우차은우차은우차은우차은우차은우


# 자료가 긴 경우 변수를 사용.

print('슈퍼 에이전트 하이퍼 초필살 드래곤')
print('슈퍼 에이전트 하이퍼 초필살 드래곤')
print('슈퍼 에이전트 하이퍼 초필살 드래곤')

# [변수명] = [변수에 담을 자료]
이름 = '슈퍼 에이전트 하이퍼 초필살 드래곤'
print(이름)   # 출력값 : 슈퍼 에이전트 하이퍼 초필살 드래곤

# 글자 일부만 떼어내기 (인덱싱)
print('슈퍼 에이전트 하이퍼 초필살 드래곤'[0])         #출력값 : 슈 (0번째 값 출력)
print('슈퍼 에이전트 하이퍼 초필살 드래곤'[0:2])       #출력값 : 슈퍼 (0번째부터 2번째까지의 값 출력)



